{
    "upcoming": [
              
    ],
    "year25": [
         {
            "eventName":"Umang '25",
            "eventDate": "October 26th, 2025",
            "eventLink": "",
            "shortDesc": "",
            "images": [
                "2025/Umang 25.jpg"
            ]
        },
        {
            "eventName": "Supernova Sabotage",
            "eventDate": "October 8-10th, 2025",
            "shortDesc": "Nova trapped in his home planet needed help! ",
            "images": [
                "2025/Treasure Hunt.png"
            ]
        },
        {
            "eventName":"Blood Moon Observation",
            "eventDate": "September 7th 2025",
            "shortDesc": "India was witnessing a total lunar eclipse after 6 years and NAC was all set to get the NISER community to view this amazing spectacle. Under the red glow of the moon, the rooftop was filled with enthusiastic students and professors, head filled with questions. Three telescopes were set up, each displaying the eclipse in varying magnifications. For the eager few that stayed up, a possible sighting of the International Space Station was up for grabs. Unfortunately, the sky gods denied us a sight of it.",
            "images": [
                "2025/Blood Moon.jpg"
            ]
        },
        {
            "eventName":"Induction Batch25",
            "eventDate": "September 6th, 2025",
            "shortDesc": "The club expanded its family with the induction of members from the new batch. The induction quiz was conducted by the club's senior most member on campus, Abhinav bhaiya. We inducted around 50 eager members from the junior-most batch and are all set to welcome them into the club activities.",
            "images": [
                "2025/Induction 25.jpg"
            ]
        },
        {
            "eventName": "Farewell Batch '20 ",
            "eventDate": "August 15, 2025",
            "shortDesc": "Bye Bye Batch '20! As a token of gratitude for the contributions of the Batch 20 seniors, the Astro Club organized a minimalistic farewell event on the evening of August 15th. The gathering included fun games and casual conversations, allowing the seniors to reminisce and share their experiences with the younger members under the open night sky at the SPS Rooftop.",
            "images": [
                "2025/Farewell B20.png"
            ]
        } 
    ],
    "year24": [
        {
            "eventName": "A \"Highly Commended\" honor received in Astronomad's APERTURE: Indian Astrophotography Competition",
            "eventDate": "December 22, 2024",
            "shortDesc": "A huge thank you to our beloved seniors for all the knowledge and guidance. And as a token of grattitude we organiseOur image of Jupiter (p.c.:Vishal Meena and NAC) was exhibited at the \"Lights of Cosmos\" exhibition at the M.P. Birla Plantetarium, Kolkata. It was also featured in the prestigious IAPY 2024 Yearbook, published online on December 22nd 2024.",
            "blogEntry": "",
            "images": [
                "2024/astrcomp.jpeg"
            ]
        },
        {
            "eventName": "Umang '24",
            "eventDate": "September 13-15th, 2024",
            "shortDesc": "As part of NISER's intra-college fest Umang, NAC has hosted two events - 'Stellar Shorts' and 'Conspire Con'. Conspire Con was an entertaining success with many theories made up by students were brought forward and Stellar Shots brought out the creativity within students which allowed the spread of knowledge.",
            "blogEntry": "https://sites.google.com/niser.ac.in/gymkhana/events",
            "images": [
                "2024/conspirecon-umang.jpeg"
            ]
        },      
        {
            "eventName": "Unveiling KALPANA: NAC's very own Observatory",
            "eventDate": "August 22, 2024",
            "shortDesc": "The wait for NAC's brand new observatory, 'Kalpana' is finally over, thanks to the contributions of club legends who worked day and night to make this possible. Cheers to a new era at NAC!",
            "blogEntry": "",
            "images": [
                "2024/kalpana.jpg"
            ]
        },
        {
            "eventName": "StarStrider: The Astro Treasure Hunt",
            "eventDate": "August 23rd to 25th, 2024",
            "shortDesc": "The Space Time Authority had intercepted signals indicating a growing instability in the spacetime continuum originating from the NISER campus. The threat has now been eliminated thanks to the valiant efforts of Team \"Aasmani Tatte\". Shoutout to all the other astrocadets who helped in this grand cosmic mission.",
            "blogEntry": "",
            "images": [
                "2024/starstrider.jpg"
            ]
        },

        {
            "eventName": "Au Revoir Batch '19",
            "eventDate": "May 10th 2024",
            "shortDesc": "As a token of gratitude for the contributions of the Batch 19 seniors, the Astro Club organized a minimalistic farewell event on the evening of May 10th. The gathering included fun games and casual conversations, allowing the seniors to reminisce and share their experiences with the younger members under the open night sky at the Yamuna cricket ground.",
            "blogEntry": "",
            "images": [
                "2024/farewell4.jpg"
            ]
        },
        {
            "eventName": "Astrophotography Workshop",
            "eventDate": "April 6th 2024",
            "shortDesc": "A mini astrophotography workshop by Vishal Meena (Int. M.Sc. Physics B22) was held that focused on data collection and processing. Participants learned techniques for capturing stunning images of celestial objects using telescopes and cameras. The workshop covered topics such as equipment setup, exposure settings, and image stacking. Attendees also gained hands-on experience with processing software to enhance and refine their captured images.",
            "blogEntry": "",
            "images": [
                "2024/astrophtography_workshop.jpg"
            ]
        },
        {
            "eventName": "Valentine's Day Special",
            "eventDate": "February 14th 2024",
            "shortDesc": "On Valentine's Day, a stargazing session was held on the Yamuna Cricket Ground with the celestial presence of the goddess of love. Owing to prevailing weather conditions, the session predominantly constituted a naked-eye observational experience coupled with interactive discussions centered around celestial narratives and tales of love derived from the night sky.",
            "blogEntry": "",
            "images": [
                "2024/14feb.jpg"
            ]
        },
        {
            "eventName": "Prerana",
            "eventDate": "January 21st 2024",
            "shortDesc": "As part of Prerana, a Zaaria initiative event for the kids of the campus security staff, IWD and housekeeping staff of NISER to foster innovative and scientific thinking, the NAC conducted a telescope session for the kids where they were able to observe the Moon and Jupiter through the club's 6 inch Newtonian telescopes. Various posters had also been put up for the perusal of the young ones. The club members also discussed various astronomical phenomena with the keenly interested folks present there.",
            "blogEntry": "",
            "images": [
                "2024/prerana.jpg"
            ]
        }
    ],
    "year23": [
        {
            "eventName": "Winter School Special",
            "eventDate": "December 21st 2023",
            "shortDesc": "On December 21st, 2023, at 10:30 PM, an observation session unfolded for Winter school students, along with participants from various workshops and faculty members. The aim was to explore celestial wonders such as the Orion Nebula, Moon, Jupiter, Uranus, Rigel, and select star clusters using both 8-inch and 11-inch telescopes. The educational session, attended by approximately 15 participants, included valuable data collection for the Orion and Crab Nebula.",
            "blogEntry": "",
            "images": [
                "2023/winter.jpg"
            ]
        },
        {
            "eventName": "Club Induction Quiz",
            "eventDate": "November 3rd 2023",
            "shortDesc": "Club Induction quiz for interested Batch '23 students was held. An astronomy quiz with 10 basic level questions were displayed to the students to gauge their interest in astronomy.",
            "blogEntry": "",
            "images": [
                "2023/induction23.jpg"
            ]
        },
        {
            "eventName": "Aditya L1 Launch Event",
            "eventDate": "September 2nd 2023",
            "shortDesc": "NAC held a live-stream as India witnessed the historic lauch of our indigenous mission Aditya L1 to study the Sun. We also discussed the science behind Lagrange Points and the how this mission can observe solar activities and its effect on space weather in real time.",
            "blogEntry": "",
            "images": [
                "2023/adityaL1.jpg"
            ]
        },
        {
            "eventName": "Chandrayaan 3 Landing",
            "eventDate": "August 8th 2023",
            "shortDesc": "The nation united and so did we as we watched history in its making. The members of NISER have had the chance to witness the Chandrayaan 3 successfully land on the south pole of the moon, making India the first country to do so, in the live stream of Chandrayaan 3 held by NAC, with assistance from the Robotics club of NISER, on the evening of 23rd August 2023.",
            "blogEntry": "",
            "images": [
                "2023/chandrayaan3.jpg"
            ]
        },
        {
            "eventName": "NANOGrav Announcement Livestream",
            "eventDate": "June 28th 2023",
            "shortDesc": "The historic announcement by NANOGrav in which they reported the results of the analysis of their 15 year data set, and interpretations of those results was live streamed by NAC in LH4, NISER Campus. Many interested students joined the live stream including the summer students. The stream was also held online on Google Meet for students outside campus.",
            "blogEntry": "",
            "images": [
                "2023/nanograv.jpg"
            ]
        },
        {
            "eventName": "Farewell for Batch '18",
            "eventDate": "May 10th 2023",
            "shortDesc": "Batch '18 NAC members were given a hearty farewell by the juniors in a celebration to commemorate their 5 year long journey in the NAC.",
            "blogEntry": "",
            "images": [
                "2023/farewell.jpg"
            ]
        },
        {
            "eventName": "Open Day",
            "eventDate": "April 7th 2023",
            "shortDesc": "On the occasion of Open Day at NISER, the NAC, on 7th April 2023, demonstrated an experiment simulating the behavior of Gravitational Lenses on a tabletop, using Optical lenses. It started with a small talk on Einstein's General Theory of Relativity, which eventually led up to an explanation of the topic of our experiment's interest, 'Gravitational Lensing'. This was followed by explaining to the school students, about the 8-inch telescope owned by the NAC, along with a small observation session of the Earth's Moon.",
            "blogEntry": "",
            "images": [
                "2023/openday-1.jpg"
            ]
        },
        {
            "eventName": "Tvisha '23",
            "eventDate": "March 18th 2023",
            "shortDesc": "During the Tvisha, the inter-college fest, NAC hosted two engaging activities: the \"ANTARIKSH\" Astro quiz competition and the \"GAGAN\" astrophotography competition. Students from various institutes participated, showcasing their skills. Victors received cash prizes and trophies as recognition of their achievements.",
            "blogEntry": "",
            "images": [
                "2023/tvisha-1.jpg"
            ]
        }
    ],
    "year21": [
        {
            "eventName": "COSNOVA: Symphony from Chaos!",
            "eventDate": "October 2021",
            "shortDesc": "COSNOVA was an online Inter-College Astronomy Competition that was organized by NAC, with events including Astro Treasure Hunt, Logo-Making, 'Elucidate' and a classic Astro Quiz.",
            "blogEntry": "cosnova21",
            "images": [
                "2021/cosonova.png"
            ]
        }
    ],
    "year19": [
        {
            "eventName": "Solar Eclipse Observation by BCM",
            "eventDate": "December 26th 2019",
            "shortDesc": "While most of the NAC was busy hosting the schools on the Solar Eclipse day, a few went to host the Solar Eclipse observation session held by Bigyan Chetna Manch (BCM), Odisha. The crew went there with 2 telescopes and let the public view the magnificent site. A discussion session was steered by out members for awareness about the eclipses in the general public.",
            "blogEntry": "",
            "images": [
                "2019/bcm.jpeg"
            ]
        },
        {
            "eventName": "Solar Eclipse Observation at NISER",
            "eventDate": "December 26th 2019",
            "shortDesc": "The highly enthusiastic NAC members never leave an opportunity to quench the same level of enthusiasm of young school kids. Among its various outreach programs, NAC invited the school students to observe the Solar Eclipse on 29th December 2019.",
            "blogEntry": "",
            "images": [
                "2019/eclipse.jpeg"
            ]
        },
        {
            "eventName": "International Dark Matter Day",
            "eventDate": "October 31st 2019",
            "shortDesc": "NAC members successfully volunteered in the celebration of 'International Dark Matter Day 2019' held on 31st October. It was a student outreach program by the SPS, NISER aimed to familiarize school students with the concept of Dark matter. In 2019, NISER was the only institute in India to celebrate International Dark Matter Day.",
            "blogEntry": "",
            "images": [
                "2019/darkmatter.jpeg"
            ]
        },
        {
            "eventName": "Chandrayaan 2 Landing: The Historic Moon Landing",
            "eventDate": "September 7th 2019",
            "shortDesc": "7th September 2019, IST 0100 hours. Almost 60-70 students were busy putting on the show for perhaps one of the most mammoth of the events to be held at NISER. Yes, it was 'Chandrayaan-2: The Historic Moon Landing', the first-ever outreach event held by the School of Earth and Planetary Sciences (SEPS) of NISER. The event aimed to celebrate the moon landing of Chandrayaan-2 and also to let the students be aware of the lunar exploration missions and the exciting research being held at SEPS. To grace the occasion, we had Prof. J. N. Goswami, the chief scientist of the Chandrayaan-1 mission, the man who was at the helm of affairs for ISRO's Mars Orbiter Mission as well.",
            "blogEntry": "",
            "images": [
                "2019/chandra0.jpg"
            ]
        },
        {
            "eventName": "ISS Transit",
            "eventDate": "April 13th 2019",
            "shortDesc": "Nearly 27 members of NISER Astronomy Club set out to the IIT Bhubaneswar sports ground; equipped with the giant telescopes in their arsenal, to observe the ISS transit at 18:41 on 13th April 2019.",
            "blogEntry": "",
            "images": [
                "2019/iss.jpeg"
            ]
        }
    ],
    "year18": [
        {
            "eventName": "Rad@Home",
            "eventDate": "October 6th 2018",
            "shortDesc": "Pleased with the functioning of the NISER Astronomy club, Dr. Ananda Hota (UGC-Faculty, UM-DAE CEBS, Mumbai & PI RAD@Home Astronomy Collaboratory, India) accepted our proposal to grace the Astronomy enthusiasts of NISER with a 'One Day RAD@Home Astronomy workshop (ODRAW)'. The event was aimed at giving students hands-on experience in extracting scientific meanings out of the images of celestial bodies (galaxies, supermassive black holes, quasars, etc.) captured. The talk was attended by 120+ NISER members and consisted of enlightening talks by Dr. Ananda Hota, Dr. Tuhin Ghosh (SPS, NISER), and Dr. Nishikanta Khandai (SPS, NISER).",
            "blogEntry": "",
            "images": [
                "2018/rad.jpeg"
            ]
        },
        {
            "eventName": "Planetarium Visit",
            "eventDate": "September 8th 2018",
            "shortDesc": "A massive troop of 93 went on an excursion to the Pathani Samanta Planetarium on 8th September 2018. Enjoying interactive shows, specially arranged for you, is probably the best way to learn something new and refreshing. As always, we were blessed to have Prof. Bedangadas Mohanty amongst us!",
            "blogEntry": "",
            "images": [
                "2018/rad1.jpeg"
            ]
        }
    ]
}