{
    "upcoming": [],
    "faculty": [
        {
            "title": "Shapes, Structures and Randomness",
            "date": "November 11, 2023",
            "speaker": "Dr. Pravabati Chingangbam",
            "speaker_desc": "Professor, Indian Institute of Astrophysics",
            "poster": "11-11-23.png",
            "youtubeID": "",
            "abstract": "The talk will introduce morphological descriptors known as scalar and tensorial Minkowski functionals, and Betti numbers. They are geometrical and topological quantities that quantify the morphological information of structures. We will connect these quantities to random fields and discuss how they reveal the statistical nature of the fields. Lastly, some physical  applications will be discussed."
        },
        {
            "title": "Hunting low-frequency gravitational waves through Pulsar Timing Arrays: The role of Indian Pulsar Timing Array",
            "date": "July 29, 2023",
            "speaker": "Dr. Manjari Bagchi",
            "speaker_desc": "Astrophysicist, IMSc, Chennai",
            "poster": "29-07-23.png",
            "youtubeID": "",
            "abstract": "We know that gravity is just the curvature of the spacetime. A mass curves the spacetime around it, and both massive and massless particles follow the curvature of the spacetime. Motion (translational, rotational or vibrational) of massive particles generate ripples in the spacetime or gravitational waves. Like electromagnetic waves, gravitational waves also have a wide range of frequencies. Gravitational waves of different frequencies are created by different sources āand we need different types of detectors to detect them. There is an innovative āmethod to detect low-frequency gravitational waves by using a number of undead stars as the detectors. These low-frequency gravitational waves are caused by mergers of supermassive black holes, and not only one mergers, many mergers resulting a summed-up background wave. As pulsars are the special type of undead star used for this purpose, we call such experiments as Pulsar Timing Array experiments. Presently, there are multiple Pulsar Timing Array experiments ongoing in various continents. These groups recently declared their results revealing a hint of the low-frequency gravitational waves. Indian Pulsar Timing Array (InPTA) is an Indo-Japanese collaboration performing PTA experiment using Indian telescope, the upgraded Giant Metrewave Radio Telescope. In the present talk, I will briefly discuss low-frequency gravitational waves, the basics of a PTA experiment, and the contribution of InPTA in this field."
        }
    ],
    "year25":[
        {
            "title": "Star, Dust, and Stardust: In a Game of Hide and Seek",
            "date": "August 30th, 2025",
            "speaker": "Shiva Thanay Pandiri ",
            "speaker_desc": "Integrated MSc (B22)SPS, NISER",
            "poster": "",
            "youtubeID": "JVnXdPGhadU",
            "abstract": "In this talk, I’ll introduce you to a certain kind of rare and technically invisible objects. To put the rarity into perspective, in a galaxy with over 100 billion stars, only about 500 of these objects have been identified as candidates. A larger sample is essential to piece together stellar evolution. After all, who wouldn’t want to learn about not the universe’s greatest, but a disappearing act done poorly? That being said, how do you even begin looking for something invisible?"
        },
        {
            "title": " Magnetic Field Structure in Spiral Galaxies",
            "date": "August 16, 2025",
            "speaker": "Abhijnan Saraswat Gogoi",
            "speaker_desc": "Int. M.Sc. (B24), SPS, NISER",
            "poster": "",
            "youtubeID": "CfkH6zvQCRY",
            "abstract": "The study of the structure of magnetic fields in spiral galaxies has been an active field of research in the past few decades. Methods have been developed to study the overall structure of the regular magnetic field in spiral galaxies using radio polarised emissions from synchrotron radiations.  I will briefly discuss the synchrotron, cyclotron radiation and Faraday rotation. Also, I will discuss how the Stokes I, Q, U and V maps are used to obtain the polarisation angle of the synchrotron radiation coming from galaxies. Lastly, I will discuss the model used to determine the structure of the magnetic fields."
        },
        {
            "title": "Eccentricity of Moon's orbit using a smartphone and the 6-inch telescope ",
            "date": "February 09, 2025",
            "speaker": "Subhajit Biswal, Aditya Raj,  Anshika Singhal, Swayamjit Kundu",
            "speaker_desc": "Int. MSc. (Batch 23), SPS, NISER",
            "poster": "09-02-25.png",
            "youtubeID": "",
            "abstract": "The Moon's orbit around Earth is not a perfect circle but an ellipse, with its eccentricity influencing observable parameters such as its apparent size. In this talk, we present our experiment, submitted to the IUCAA astronomy-themed experiments competition, where we determine the Moon's orbital eccentricity by analyzing variations in its apparent diameter over time. We'll delve into the physics behind orbital motion using the Lagrangian approach to the central force problem, deriving Kepler's three laws along the way. Additionally, we will discuss our methods for acquiring data and the real-world challenges that come with it. Finally, we will compare our findings with established values by fitting our data into two models."
        },
        {
            "title": "SED Fitting using CIGALE: Building a bridge between Photometry and Spectroscopy",
            "date": "February 01, 2025",
            "speaker": "Shiva Thanay Pandiri",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "01-02-25.png",
            "youtubeID": "",
            "abstract": "Ever tried to complete a photo puzzle only to find out some pieces are missing? Do you go out to buy a new puzzle? Or do you paint the rest of it yourself? In this talk, I will take you through how CIGALE helps you build a spectral energy distribution for a galaxy, provided you have the photometric data, step by step, from modeling the spectral contribution from all the stars to account for the redshift and explain all the words you didn't understand in the abstract up until now. See you there!"
        },
        {
            "title": "Variable Stars: Chroniclers of the Night Sky",
            "date": "January 25, 2025",
            "speaker": "Sattvik Yadav",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "25-01-25.png",
            "youtubeID": "",
            "abstract": "Variable stars are the musicians of the night sky. My internship last year explored the eclipsing binary stars and tried to understand them theoretically and model them numerically. I will introduce the domain of stars, with a special emphasis on the variable stars. I will review the types of variable stars, focusing on the two types of systems I covered in my internship and how they are helpful in astronomy. I will also cover the techniques and methods of data processing, including the Lomb-Scargle Periodogram, with a brief introduction to the PHOEBE library used for modeling eclipsing binary stars."
        },
        {
            "title": "AI Meets Astronomy",
            "date": "January 18, 2025",
            "speaker": "Sagar Prakash Barad",
            "speaker_desc": "Int. MSc. (Batch 20), SPS, NISER",
            "poster": "18-01-25.png",
            "youtubeID": "",
            "abstract": "The exponential growth of astronomical data necessitates the use of deep learning techniques to extract meaningful insights and address previously intractable problems. Artificial intelligence (AI), particularly neural networks, has become an essential companion in this data-driven era of astronomy. From classifying celestial objects to detecting exoplanets and estimating photometric redshifts, AI has demonstrated its versatility and transformative impact on the field. In this talk, we will trace the evolution of connectionism in astronomy through its three waves: the early use of multilayer perceptrons, the rise of convolutional and recurrent neural networks, and the current era of unsupervised and generative deep learning methods. Looking ahead to the anticipated fourth wave of astronomical connectionism, we advocate for the adoption of GPT-like foundation models fine-tuned for astronomical applications. These models have the potential to harness the wealth of high-quality, multimodal astronomical data, enabling state-of-the-art downstream tasks. By the end of this talk, I hope to provide you with a comprehensive understanding of the evolving partnership between artificial intelligence and the exploration of our universe, as we navigate the path toward future discoveries."
        },
        {
            "title": "Exploring the Cosmic Microwave Background Radiation",
            "date": "January 15, 2025",
            "speaker": "Dr. Aditi Sen",
            "speaker_desc": "Astrophysicist, TIFR, Mumbai",
            "poster": "15-01-25.png",
            "youtubeID": "",
            "abstract": "The Cosmic Microwave Background (CMB) radiation is a relic from the early universe, providing a snapshot of the cosmos when it was just 380,000 years old. In this talk, we will explore the significance of the CMB in cosmology, its discovery, and the insights it offers into the formation and evolution of the universe. We will also discuss the latest findings from CMB experiments and their implications for our understanding of dark matter and dark energy."
        }
    ],
    "year24": [
       
        {
            "title": "Beyond Sight: Discovering Radio Astronomy",
            "date": "November 02, 2024",
            "speaker": "Srusti Sampanna",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "02-11-24.png",
            "youtubeID": "",
            "abstract": "Have you ever wondered what lies hidden beyond our sight? What if I told you that the most intriguing stories of the universe are whispered in waves we can't see? Join us as we delve into the captivating field of Radio Astronomy to access the universe's best-kept secrets. This talk is part of the Introductory series, specifically aiming for first-year students to provide a comprehensive overview of the field. This talk will cover the fundamental concepts of radio astronomy, their significance in astronomical research, powerful tools such as radio telescopes, understanding how astronomers extract and decode the information from radio data along with highlighting some of the groundbreaking discoveries that have shaped our understanding of the universe, such as Cosmic Microwave Background Radiation (CMBR)."
        },
        {
            "title": "Galaxy Evolution and Bar Formation",
            "date": "October 26, 2024",
            "speaker": "Pratik Chandra Nath",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "26-10-24.png",
            "youtubeID": "",
            "abstract": "A significant fraction of galaxies exhibit bars, which play a crucial role in their evolution. This talk will focus on the formation and evolution of galaxies and bars, the bar fraction, and its variation with redshift. Additionally, I will discuss how Convolutional Neural Networks (CNNs) can aid in identifying barred galaxies, aiding in our understanding of galactic structure and morphology."
        },
        {
            "title": "Photometry in Astronomy",
            "date": "October 26, 2024",
            "speaker": "Arnab Biswas",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "26-10-24.png",
            "youtubeID": "",
            "abstract": "Photometry is one of the most used and essential tools in astronomy. The sparkling tiny dots we see in the night sky tell us a cryptic story of almost everything happening in the universe. Photometry lets us decode these hints just by knowing how bright a dot is. In this talk, I will introduce the principles and different methods of photometry and discuss their applications."
        },
        {
            "title": "An Introduction to X-Ray Astronomy",
            "date": "October 19, 2024",
            "speaker": "Shishir H",
            "speaker_desc": "Int. MSc. (Batch 21), SPS, NISER",
            "poster": "19-10-24.jpg",
            "youtubeID": "",
            "abstract": "X-ray astronomy has seen significant advancements spanning over many decades and remains a dynamic field of study even today. In this talk, we will explore the history of X-ray astronomy, examining how early discoveries paved the way for modern research. We will also discuss the broad classifications of X-ray sources in the universe, highlighting their importance in probing the fascinating physics of celestial objects such as binary systems and pulsars, to name a few. In the second part of the talk, we will delve into time series analysis—an essential tool not only in X-ray astronomy but across many other fields. Using examples from X-ray sources, we will explore how time series analysis enables us to understand and differentiate between the properties of different sources."
        },
        {
            "title": "Huge Radio Telescopes and Where to Find Them",
            "date": "September 21, 2024",
            "speaker": "Vasanth Kashyap",
            "speaker_desc": "Int. MSc. (Batch 19), SPS, NISER",
            "poster": "21-09-24_Vasant.jpg",
            "youtubeID": "",
            "abstract": "This is a story that started as a casual tea table conversation in December 2023 and led to an oppurtunity to do some interesting observations using the latest upgraded GMRT radio telescope couple of weeks ago. This is a state of the art facility, comprising of 30 radio antennae, each 45 m in size spread over 25 kms at Khodad, Pune. I was at the facility for a few days and in this talk, I will discuss how exactly it all went about. The proposals, technical details, actual observations and the future of this project. This, I believe is just a step towards a bigger global project to build a \"Faraday Telescope\"."
        },
        {
            "title": "Introduction to Solar Astrophysics",
            "date": "September 21, 2024",
            "speaker": "SriUma Maheshwari Vittal",
            "speaker_desc": "Int. MSc. (Batch 22), SPS, NISER",
            "poster": "21-09-24 - Uma.jpg",
            "youtubeID": "",
            "abstract": "Solar Astrophysics is a major discipline in Astronomy, where a lot of foundational physics concepts are applied to solve problems, and understand the star that makes our existence possible. This talk will attempt to introduce the flavour of the field, by giving a brief look at the Sun, how it is studied, and the kind of problems and active areas currently being worked on."
        },
        {
            "title": "Formation of Giant Planets: Insights from Pebble Accretion",
            "date": "September 06, 2024",
            "speaker": "Anuja Raorone",
            "speaker_desc": "Int. M.Sc., IISER Pune",
            "poster": "06-09-24.jpeg",
            "youtubeID": "",
            "abstract": "The formation history of Jupiter has been of interest due to its ability to shape the solar system's history. Yet little attention has been paid to the formation and growth of Saturn and the other giant planets. Through N-body simulations on a simple disk, we have explored the formation of these planets via pebble accretion. We conducted a statistical survey of different disc parameters and initial conditions of the protoplanetary disc to establish which combination best reproduces the present outer solar system. This talk will highlight key findings on the eccentricity and semi-major axis distribution of the giant planets and provide insights into their formation timelines."
        },
        {
            "title": "Zooming in on Planetary birthplaces with ALMA",
            "date": "August 10, 2024",
            "speaker": "Parashmoni Kashyap",
            "speaker_desc": "PhD Scholar (SEPS), NISER",
            "poster": "10-08-24.jpg",
            "youtubeID": "",
            "abstract": "The origin of our solar system and the structure of planetary systems across the cosmos is a fundamental question in astrophysics. With over 5,000 exoplanetary systems discovered, none perfectly mirrors our solar system. In this talk, I will explore the journey of planetary system formation, focusing on the protoplanetary disk stage, where planets acquire their unique characteristics. I will highlight how molecular line observations using the Atacama Large Millimeter/submillimeter Array (ALMA) provide invaluable insights into these early stages, advancing our understanding of planetary origins."
            
        },
        {
            "title": "Beyond the Visible: Exploring the Universe with Neutral Hydrogen",
            "date": "August 3, 2024",
            "speaker": "Tanya Tripty",
            "speaker_desc": "PhD student (SPS), NISER",
            "poster": "03-08-24.jpg",
            "youtubeID": "",
            "abstract": "Imagine a cosmic detective story where the most common element in the universe plays the starring role. This tale is about neutral hydrogen, the simplest atom in existence, consisting of just one proton and one electron. However, do not be deceived by its simplicity– neutral hydrogen holds the key to unlocking some of the universe's greatest mysteries. In this cosmic exploration, we'll first uncover the essence of neutral hydrogen and why astronomers are so excited about it. Finally, we'll put on our detective hats and learn how to decode the secret messages hidden in hydrogen's spectral fingerprint. This special light signature, emitted at a wavelength of 21 centimeters, tells us incredible stories about the motion, mass, and history of galaxies. By the end of our adventure, you'll understand why this invisible gas is so visible to astronomers and how it's helping us piece together the puzzle of our cosmic neighborhood."
        },
        {
            "title": "My Research Experience during a Master's Project",
            "date": "April 6, 2024",
            "speaker": "Abha Vishwakarma",
            "speaker_desc": "Int. M.Sc. (B19), SPS, NISER",
            "poster": "06-04-24.jpg",
            "youtubeID": "",
            "abstract": "For those of us who wish to continue down a path towards academia, somewhere along the way, we most certainly have to do a PhD. But do we have the right idea of what research feels like? That is the question I set out to answer when I chose to take a break for a year, not apply anywhere, and spend all of my time on one thing - my thesis. I had to re-evaluate my choices of being an academic. I worked on a thesis that was new in many aspects for my supervisor too, similar to a PhD. I learned many things, from how to think and approach a problem, how to deal with setbacks, how to organise my research, and so much more, and I believe I should talk about it. Personally for me, I was not aware of most of the things I will be talking about, so perhaps this discussion might be helpful to others too. A disclaimer is that it is my individual experience and might be a bit specific to Astrophysics-related research, but I will try to be as general as possible."
        },
        {
            "title": "Navigating the Mysteries of the Sun through Physics",
            "date": "January 20, 2024",
            "speaker": "N Sneha",
            "speaker_desc": "Int. M.Sc. (B21), SPS, NISER",
            "poster": "",
            "youtubeID": "vlMSDhYSsVY",
            "abstract": "The Sun, a celestial powerhouse, not only dictates the rhythm of our days but also holds the key to profound mysteries. Understanding its workings unlocks a treasure of scientific insights. This talk will cover: 1. Motivation to study this massive celestial object. 2. Brief introduction to solar observations. 3. An account of the Coronal Heating Problem. 4. Introduction to hydrodynamics (HD) and Magnetohydrodynamics (MHD). 5. Emphasis on two particular solutions to the Coronal Heating Problem: (a) Magnetohydrodynamics-wave driven Kelvin-Helmholtz Instability in Coronal Loops. (b) Ambipolar Diffusion in Solar Winds. 6. Simulations conducted and some results presented. "
        },
        {
            "title": "The Rise and Fall of Pluto!",
            "date": "January 13, 2024",
            "speaker": "Aniketh Nath",
            "speaker_desc": "Int. M.Sc. (B20), SPS, NISER",
            "poster": "13-01-24.png",
            "youtubeID": "",
            "abstract": "We all have heard that Pluto was considered the ninth planet of the solar system, but now it is no longer a planet. The story of Pluto from its discovery to its enlistment under the category of a dwarf planet is an interesting one. I shall try to cover some aspects of this story backed by the theoretical notions that were at play at different events of this story."
        }
    ],
    "year23": [
        
        {
            "title": "Introduction to Cosmology",
            "date": "October 20, 2023",
            "speaker": "Abhinav Roy",
            "speaker_desc": "Int. M.Sc. (B20), SPS, NISER",
            "poster": "",
            "youtubeID": "xHIQ9tcUKeY",
            "abstract": "Cosmology is the study of the physical universe and due to both theoretical and observational developments, it has made enormous strides in the past 100 years. Cosmology has answered age-old questions involving the universe's age, geometry, and composition. In this talk, we will see the journey of cosmology as a science, learn more about our universe, and discuss the efforts of a few to answer the questions of many."
        },
        {
            "title": "Orbital Dynamics near Lagrange Points",
            "date": "October 14, 2023",
            "speaker": "Sri Uma Maheshwari",
            "speaker_desc": "Int. M.Sc. (B22), SPS, NISER",
            "poster": "",
            "youtubeID": "Ck-VpP-x1FA",
            "abstract": "Many satellites, such as Aditya L1 and JWST, are seated at specific vantage points in space called Lagrange points. This talk will go step by step through the process of finding a numerical solution to an analytically unsolvable physical problem and also discuss the orbits of known astronomical objects around these points."
        },
        {
            "title": "Introductory Talk: An Introduction to Positional Astronomy",
            "date": "October 9, 2023",
            "speaker": "Gayatri P",
            "speaker_desc": "Int. M.Sc. (B22), SPS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc?start=2163",
            "abstract": "When you look at the night sky, you are greeted with the familiar sparkling points of light situated on the surface of a vast sphere of which you are at the centre. But to make any astronomical observation, you need to know precisely where to look, that is, the location of celestial objects in our night sky. Spherical or positional astronomy is a sub-field of astronomy that deals with the directions in which these celestial objects are viewed and predicts how they vary over space and time. One of the most ancient forms of science, here we learn how to locate objects on the celestial sphere — as seen at a particular date, time, and location on Earth — just as we measure positions on Earth's surface by Latitude and Longitude. Along the way, we also will encounter certain astronomical phenomena observed on Earth."
        },
        {
            "title": "Introductory Talk: An introduction to Astrophotography and the photo of the moon",
            "date": "October 9, 2023",
            "speaker": "Vishal Meena",
            "speaker_desc": "Int. M.Sc. (B22), SCS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc?start=1043",
            "abstract": "This talk will introduce the basics of astrophotography, with a focus on a photo of the moon that our club recently took. We will discuss the equipment and techniques that we used to capture the photo, as well as the challenges and rewards of astrophotography. The photo of the moon that we will be discussing is a high-resolution image that was taken using a telescope and a specialized sensor. The photo shows the moon in stunning detail, including its craters, mountains, and valleys. We will discuss how we captured the photo and how we processed the data to achieve such high quality."
        },
        {
            "title": "Introductory Talk: Search for water in the Universe",
            "date": "October 9, 2023",
            "speaker": "Asmi Nandy",
            "speaker_desc": "Int. M.Sc. (B22), SCS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc",
            "abstract": "For the longest time, we have been curious about the existence of life beyond Earth. Are we really alone in the Universe? This is a question we have been asking ourselves for quite some time. Water is supposed to be the a priori requirement that enabled life to evolve on our planet. It makes sense thus that we look for it elsewhere in the search for our brethren in space. How do we look for water, then? What are the processes used to detect its presence someplace millions of light years away from us? And how successful have we been in our search until now? Join us for the discussion session to find out!"
        },
        {
            "title": "Laboratory astrochemistry techniques for investigating kinetics of reactions in space",
            "date": "September 9, 2023",
            "speaker": "Aditi Pradhan",
            "speaker_desc": "Int. M.Sc. (Batch 19), SCS, NISER",
            "poster": "",
            "youtubeID": "ATTW-qrkLJ8",
            "abstract": "Over 200 species have been detected in the cold, neutral regions of the ISM over the past 80 years. The existence of such a rich and diverse range of chemistry even at very low temperatures and densities, raises several interesting questions about the origin of these species and how the energy barrier for reactions is surpassed at such low temperatures. The hunt for answers has led to the highly interdisciplinary field of Astrochemistry. Astrochemistry proceeds on 3 interlinked fronts, namely - observations, modelling and laboratory experiments. Laboratory astrochemistry is central to enhancing our understanding of the present composition of ISM, as well as the chemical origins of the universe. Laboratory spectroscopy aids observations in confirming the detection of new species in space. On the modelling front, parameters such as rate constants and branching ratios are required and can only be measured experimentally. The measurement of these parameters in a laboratory while mimicking the conditions in space, is a multi-fold challenge. This has led to the development of several novel experimental techniques, and innovative combinations of existing methods. The aim of this talk is therefore, to highlight the various experimental techniques involved in laboratory astrochemistry. More specifically, I will be discussing the novel CRESUCHIRP apparatus developed by Dr. Ian Sims and his group at the University of Rennes, where I worked over the summer."
        },
        {
            "title": "X-Ray Binaries and Use of MESA",
            "date": "September 2, 2023",
            "speaker": "Pulkit Ojha",
            "speaker_desc": "Research Assistant, IMSc, Chennai (B18 Alumni)",
            "poster": "",
            "youtubeID": "EUgdumX9SyQ",
            "abstract": "Binary stars, comprising more than 90% of the stars we see in our night sky, play a significant role in all kinds of astrophysical research. A peculiarly interesting category is x-ray binary, which happens to have compact stellar remnants, specifically a neutron star as one of their components. X-ray binaries act as space-based laboratories, allowing us to study the physics of accretion and the neutron star with good proximity observations. They also serve as progenitor systems to some exotic objects like millisecond pulsars and ultra-compact binaries releasing gravitational waves. For more than a year now, I've been working on modelling a class of such X-ray binaries using tools like MESA(Modules of Experiments in Stellar Astrophysics), the state-of-the-art Fortran-based 1D stellar simulation package. In the talk, I plan to start with a discussion about different classes of X-ray binaries and their wide applicability in astrophysics in the first part. Secondly, I'll present a small overview of my thesis work and the significance of such theoretical studies. I'll conclude the talk by talking about MESA, why it is important for anyone interested in working in astrophysics and how to use it as a beginner."
        },
        {
            "title": "Magnetic Field of Stars ",
            "date": "August 19, 2023",
            "speaker": "Monu Kumar Choubey",
            "speaker_desc": "Int. M.Sc. (Batch 20)",
            "poster": "",
            "youtubeID": "igfQQn2Zn-g",
            "abstract": "In this talk, I will introduce the study of magnetic field of stellar bodies, including their origin, modeling, observation and interpretation. There's a special focus on Sun and sun-like stars, extending to white dwarfs and other stellar bodies. Lastly, there's brief mention of exotic bodies like neutron stars and magnetars."
        },
        {
            "title": "The Ballet of the Medicean Stars",
            "date": "August 12, 2023",
            "speaker": "Shreya Jay  &  Samarth Mohan Nanjannavar",
            "speaker_desc": "Int. M.Sc. (B21), SPS, NISER",
            "poster": "",
            "youtubeID": "jJlra_udsA0",
            "abstract": "The main aim is to find out the time-period of 4 bright moons of  Jupiter (IO, Callisto, Ganymede, and Europa) on pure experimental background i.e., without using any theoretical knowledge. We present to you the first experiment that the NAC Experimental team undertook. This was first done by Galileo. The problems encountered during the data analysis were versatile. The logic and method of solving the problems encountered is especially emphasised upon. Further we also used the data to find the mass of Jupiter using some basic literature on the topic."
        },
       
        {
            "title": "A Misty Mystery: Unraveling Cloud Formation in Alien Skies",
            "date": "April 22, 2023",
            "speaker": "Rahul Arora",
            "speaker_desc": "Int. MSc. (Batch 18), SEPS, NISER",
            "poster": "",
            "youtubeID": "0ZD5jV02bo8",
            "abstract": "Cloud formation plays a key role in the atmospheric dynamics of exoplanets, which can significantly impact their overall climate and habitability. This makes understanding of cloud formation and evolution in exoplanetary atmospheres very critical for interpreting observational data and characterizing these faraway worlds. In this talk, we will explore the various physical and chemical processes that contribute to cloud formation on exoplanets, such as condensation, nucleation, and growth. We will also discuss how cloud properties such as composition, size, and distribution can vary depending on the specific environmental conditions of the exoplanetary atmosphere, such as temperature, pressure, and atmospheric composition. In the end, we will review the current theoretical approaches for studying cloud formation in exoplanets and their impacts on observational interpretation and highlight some of the key challenges and open questions in this rapidly-evolving field of research."
        },
        {
            "title": "Thinking Prebiotically: The study of Chemical Origin of Life and its Astronomical Implications",
            "date": "March 25, 2023",
            "speaker": "Adesh Natthuji Thawale",
            "speaker_desc": "Int. MSc. (Batch 18), SCS, NISER",
            "poster": "",
            "youtubeID": "cJRskYH3efk",
            "abstract": "One of the leading theories for the origin of life is the Chemical Origin of Life, which involves mixing and matching simple molecules to form complex ones. Think of it like a giant chemistry experiment, but instead of baking a cake, we are trying to create life. But if you're feeling adventurous and want to explore more before the talk, we've got some papers at the end that will give you a deeper dive into the topic. Who knows, you might even find your calling in life (pun intended) and become a Chemical Origin of Life researcher. So, join us for a discussion that will be equal parts informative and entertaining. Let's get to the bottom of how life began!"
        },
        {
            "title": "Keep Calm and Let The Planets Form",
            "date": "January 28, 2023",
            "speaker": "Baibhav Srivastava",
            "speaker_desc": "IISER Berhampur, Batch 18",
            "poster": "28-01-23.jpg",
            "youtubeID": "",
            "abstract": "By now you all surely know that planets form in disk-like structures, called protoplanetary disks, around young stars. But how exactly?"
        },
        {
            "title": "How did our Earth and Solar system form?",
            "date": "January 21, 2023",
            "speaker": "Prathap Rayalacheruvu",
            "speaker_desc": "PhD Scholar (SEPS), NISER",
            "poster": "21-01-23.jpg",
            "youtubeID": "",
            "abstract": "Our Solar System is believed to have been formed about 4.6 billion years ago in a cold molecular cloud. Its origin and evolution are still a mystery. The present state of planetary bodies, including our own Earth and the life on it are the direct result of various evolutionary processes that these planetary objects have gone through during these many years. Now the question is “Can we trace down the evolutionary processes of the planetary bodies and understand how life came about on planets like our Earth?” In this talk I will introduce you to some astrochemical tools which go a long way in addressing the above question."
        },
        {
            "title": "Alien worlds in the JWST era: No more a Science fiction",
            "date": "January 14, 2023",
            "speaker": "Priyankush Ghosh",
            "speaker_desc": "PhD Scholar (SEPS), NISER",
            "poster": "14-01-23.jpg",
            "youtubeID": "",
            "abstract": "Ever since humanity has existed, it has looked into the night sky and wondered “Is there life elsewhere in the universe?” and “How did our Earth and other planets form and evolve?” Exoplanetary science, a new interdisciplinary field that emerged 25 years ago has the capability to answer just that. This talk involves basic introduction to the far away alien worlds, why are they so interesting, how to find them, what are the current research works going on in the field and what future beholds. I will also discuss how to decode an exoplanet spectrum to search for signs of alien life and its implication with respect to current research."
        }
    ],
    "year22": [
        {
            "title": "Surfing through Exoplanets",
            "date": "November 12th, 2022",
            "speaker": "Chandan Kumar Sahu",
            "speaker_desc": "Int. M.Sc. B19 SPS, NISER",
            "poster": "12-11-22.jpg",
            "link": "",
            "abstract": "In this vast universe, it is inappropriate to think that Earth is the only planet sustaining life. So, are there really planets outside our solar system that can host life? Billions are spent every year on detection and study of planets which can possibly host life. This talk will be an introduction to the basic methods that are used in the modern era for detection of exoplanets and studying them. I will also hover over the different types of exoplanets and some of their properties. At the end, I will briefly mention current research in the field of exoplanetary systems."
        },
        {
            "title": "Determination of Solar offset using Cepheids",
            "date": "November 5th, 2022",
            "speaker": "Swaroop R Avarsekar",
            "speaker_desc": "Int. M.Sc. B20 SPS, NISER",
            "poster": "5-11-22.jpg",
            "link": "",
            "abstract": "The sun's galactocentric radius (RGC) is previously calculated and known. It has also been established that our sun is not located precisely on the galactic plane but is slightly displaced. Previous estimates have calculated this solar offset (z) using sources such as OB stars, young open clusters (YOCs), pulsars, Etc. The right ascension and declination of Cepheids, obtained from The Optical Gravitational Lensing Experiment (OGLE) catalog cross-matched with the GAIA mission's - DR3, provides a way to calculate the z. This talk will give a quick tour into Cepheids, the data, and visualize the sun's coordinates in the milky way galaxy."
        },
        {
            "title": "Introduction to Cosmology: A chronology of the Universe",
            "date": "October 15th, 2022",
            "speaker": "Soham Bannerjee",
            "speaker_desc": "PhD, SPS, NISER",
            "poster": "15-10-22.jpg",
            "link": "",
            "abstract": "Observational Cosmology has come a long way. The Cosmological Principle states that the Universe is spatially homogeneous and isotropic on the largest scales. Hubble's data indirectly proved this principle when he found the relation between the speed and distance of galaxies. The Big Bang model has been widely accepted, which claims that the Universe evolved from a fireball that eventually cools to the structures we see today. Peebles suggested radiation from the early Universe, which was discovered by Penzias and Wilson, as the cosmic microwave background, which gives a compelling foundation for this model. In this talk, the speaker gave an overview of the formation of light nuclei(big bang nucleo-synthesis), recombination(formation of first atoms), the radiation from the early Universe(CMB), and large-scale structure formation."
        },
        {
            "title": "Introduction to Cosmology: Why is the night sky dark?",
            "date": "September 4th, 2022",
            "speaker": "Abha Vishwakarma",
            "speaker_desc": "Int. M.Sc., B19 SPS, NISER",
            "poster": "4-09-22.jpg",
            "link": "",
            "abstract": "The night sky appears very different from the earth or the solar system. At a very large scale, large enough to contain many, many galaxy clusters, our universe looks and behaves very differently compared to solar systems, individual galaxies or even clusters of galaxies. Gravity doesn't seem to work according to Newtonian principles. A new theory of gravity, the General Theory of Relativity, formulated by Albert Einstein, sheds light on our understanding of the large-scale universe. In this talk, I will take you through the history that led to the birth of Cosmology, the study of the nature of our universe. I will then develop the notion of 'curvature of the universe', discuss how it can be measured and discuss its implications on the notion of distance between any two points in the universe. This talk covers the prerequisites required to understand the Friedmann equations and the governing equations of the universe's evolution, which will be covered in the next talk. The goal at the end will be to have an interactive talk, where I will simulate universes with different densities of matter, radiation etc. using python and see how it evolves with time."
        },
        {
            "title": "Stellar Astrophysics II: Classification and Evolution of stars",
            "date": "August 27th, 2022",
            "speaker": "Vasanth Kashyap, Pulkit Ojha",
            "speaker_desc": "Int. M.Sc. B19, SPS, NISER, Int. M.Sc., B18 SPS, NISER",
            "poster": "27-08-22.jpg",
            "link": "",
            "abstract": "In the last talk on stellar astrophysics, the basics of stellar structure and the origin of stars was covered by Vasanth. In the upcoming talk, the classification of stars based upon their spectral luminosity will be discussed and if time permits, we'll also try to present a basic overview of stellar evolution. This talk may be followed by a demonstration of stellar evolution using MESA."
        },
        {
            "title": "Stellar Astrophysics: Origin, Structure and Classification",
            "date": "August 20th, 2022",
            "speaker": "Vasanth Kashyap",
            "speaker_desc": "Int. M.Sc., B19 SPS, NISER",
            "poster": "20-08-22.jpg",
            "link": "",
            "abstract": "This is the second talk in the 'Stellar Physics Triad'. In this talk I hope to glance over the fundamentals of stellar astrophysics. Topics of star formation, stellar structure and spectral classification shall be discussed along with their underlying principles with sufficient mathematical detail. It will be followed by brief discussions on Hertzsprung Diagram and Morgan Keenan Luminosity Classes."
        },
        {
            "title": "The Solar Cycle, Magnets, and More",
            "date": "August 13th, 2022",
            "speaker": "Ratul Das",
            "speaker_desc": "Int. M.Sc., B20 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "The Babcock-Leighton model of the solar dynamo is often noted as the most accurate qualitative mechanism for explaining the Solar cycle, despite being initially formulated about 70 years ago, when only terrestrial data from the Sun was available. It successfully explained how and why sunspots form, along with the relation between the oscillatory 22-year Solar cycle and the evolution of the magnetic field (basically, a whole backflip) of the Sun."
        },
        {
            "title": "Birth of Cosmology",
            "date": "April 23rd, 2022",
            "speaker": "Abhinav Roy",
            "speaker_desc": "Int. M.Sc. B20 SPS, NISER",
            "poster": "23-04-22.jpg",
            "link": "",
            "abstract": "Cosmology is the study of the physical universe and due to both theoretical and observational developments, it has made enormous strides in the past 100 years. Cosmology has answered age-old questions involving the universe's age, geometry, and composition. In this talk, we will see the journey of cosmology as a science and the efforts of a few to answer the questions of many."
        }
    ],
    "year21": [
        {
            "title": "Solar Storms",
            "date": "December 24th, 2021",
            "speaker": "Monu Kumar",
            "speaker_desc": "Int. M.Sc. B20 SPS, NISER",
            "poster": "24-12-21.jpg",
            "link": "",
            "abstract": "A solar storm is a blanket term for events of solar disturbance, emanating outwards from the heliosphere, leading to various effects. I will talk about the origin of these events at the sun, shedding some light on our understanding of them and how we have come to such an understanding. We will also explore why these events are interesting and important, in various contexts. Lastly, I will try to give some insight into its effects on the earth and future frontiers."
        },
        {
            "title": "Sun : The Literal Star of our Solar system",
            "date": "October 23rd, 2021",
            "speaker": "Swosti Prakash Sarangi",
            "speaker_desc": "Int. M.Sc. B20 SPS, NISER",
            "poster": "23-10-21.jpg",
            "link": "",
            "abstract": "More often than not, we are ignorant to things that are closer to us. One such thing is the Sun. No matter how much we know about it already, it never fails to surprise us. In this talk, I will try to present the different shades of the Sun, explain the physics behind them and use the Sun as a subject to gain some useful insights into stellar astronomy. Also, I shall share some of the mythical tales surrounding the Sun. Towards the end, I shall discuss some paradoxes and open problems in the field of solar physics."
        },
        {
            "title": "A brief Overview of Digital Imaging",
            "date": "June 12th, 2021",
            "speaker": "Adesh Natthuji Thawale",
            "speaker_desc": "Int. M.Sc. B18 SCS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Image sensors are probably one of the most commonly used sensors in the entire world, yet very few people realise the complex process that goes into creating the image that they see after pressing the sensor button in the camera app of their smartphones. In the first session of the Image Processing Workshop, attendees will be taught about the characteristics of image Sensors and Images. The goal of session 1 is to familiarize the attendees with the process that goes into creating a digital image from modern sensors, so that they will better understand the processes that go into image processing. At the end of the session the attendees will be taught how to create star trails using just their phones and a simple software (StarStaX)."
        },
        {
            "title": "Diving into the surreal field of Exoplanets",
            "date": "June 12th, 2021",
            "speaker": "Akshay Priyadarshi",
            "speaker_desc": "Int. M.Sc. B16 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Being a common occurrence in pop-sci and also at the home of crazy theories, the field of exoplanets does enjoy quite some attention. But have we ever looked at their importance beyond the wow factor? How \"studying others to understand ourselves\" could really be a thing!? In this talk, we'll start with an introductory know-how of the field, understanding the motivation and how exoplanets can be studied in exquisite detail despite being so small and so far! And the huge range of interdisciplinary research possibilities that lie ahead."
        },
        {
            "title": "Perseverance; a big leap towards MARS",
            "date": "March 19th, 2021",
            "speaker": "Aheesh Chandrakant Hegde & Chandan Kumar Sahoo",
            "speaker_desc": "Int. M.Sc. B19 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "In this talk, we will \"explore\" the Mars 2020 mission, the Perseverance rover and some of its onboard instruments it will be using for Mars exploration and also have a short but detailed description of 'Ingenuity - the Mars helicopter'; to entertain ourselves with the joy of knowing the latest probe on the red planet and the technicalities involved in the mission."
        },
        {
            "title": "Ancient Astronomical Calculations",
            "date": "March 1st, 2021",
            "speaker": "Nisarg Vyas",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Sure, you would have heard of Jantar Mantar. Ever peeked into the details of what instruments do they house, and what did it mean at the time of their inception to have such instruments? As a fun read, I would like you to look up about the Jantar Mantar at Jaipur. The image attached with the mail shows a model of the same, try finding out what's what. From Greek astronomer and mathematician, Ptolemy, to the Rajput king Sawai Jai Singh II, we will cover a wide period of the history of astronomy of our Sun. We will explore how the ancients calculated the Sun's rising times without the aid of spherical trigonometry. In this talk, I will try to get you started to do basic calculations in astronomy."
        }
    ],
    "year20": [
        {
            "title": "Evolution of our models of the Universe",
            "date": "September 5th, 2020",
            "speaker": "Sagar Shrivastava",
            "speaker_desc": "(B11 SMS, NISER), Ph.D. student at TIFR, Mumbai",
            "poster": "5-09-20.png",
            "link": "",
            "abstract": "Humans have been fascinated by the twinkling lights in the night sky, and have been trying to give a reason for why they are there. Whether it's the ancient Mayan with their flat earth theory or the Greeks with their geocentric theory of the universe, there have been many models of the universe, and as we are able to understand more about the fundamental forces of our universe, we have been able to get a clearer picture. This would be an introductory talk with more focus on how progress in science was able to change our view of the universe."
        },
        {
            "title": "Mapping the Universe using Sky Surveys",
            "date": "August 29th, 2020",
            "speaker": "Biprateep Dey",
            "speaker_desc": "(B13 SPS, NISER), PhD student at University of Pittsburgh.",
            "poster": "",
            "link": "6spDjmQrvHI",
            "abstract": "Astronomical surveys are used to map the universe along with discovering new phenomena. Past surveys like the Sloan Digital Sky Survey have significantly improved our understanding of the universe.  We will talk about some upcoming sky surveys like the Dark Energy Spectroscopic Instrument (DESI) and the Rubin Observatory Legacy Survey of Space and Time (LSST). We will explore the wide range of science that can be done with these instruments and why and how you may consider doing PhD research in Astronomy."
        },
        {
            "title": "Inflation, Quantum Fluctuations, and Primordial Black Holes",
            "date": "August 22rd, 2020",
            "speaker": "Swagat Saurav Mishra",
            "speaker_desc": "(Batch 08, SPS, NISER), SRF at IUCAA, Pune",
            "poster": "22-08-20.png",
            "link": "",
            "abstract": "Black Holes are extremely dense gravitationally bound objects that are usually formed via the gravitational collapse of matter during the end stages of big stars. Such black holes, which are end products of stellar evolution, are known as Astrophysical BHs. Scientists have directly and indirectly established the existence of many astrophysical BHs of mass ranging from 10 solar mass to about several  Billion solar masses. There are other types of black holes, known as the Primordial Black Holes (PBHs) that are formed in the early universe, during the hot Big Bang plasma state, long before the formation of any stars. We can refer to them as  BHs from the Big Bang. Their masses could be as small as the mass of stone, unlike the astrophysical BHs. The speaker will discuss the significance of PBHs in addressing several issues in Cosmology, from Dark Matter to the existence of supermassive BHs to Hawking Radiation."
        },
        {
            "title": "CMB Temperature Power Spectrum",
            "date": "May 8th, 2020",
            "speaker": "R Vasanth Kashyap",
            "speaker_desc": "Int. M.Sc. B19, NISER",
            "poster": "",
            "link": "",
            "abstract": "In this talk, I would like to take the audience into an understanding of the methods that enable us to move from the high uncertainties of cosmology to that of precision cosmology. All from the cosmic microwave background radiation. Understanding the CMB is possible by knowing what happened since the big bang to the creation of the CMB. How do we know the composition of the universe? How do we extract information from the fuzzy-looking cosmic microwave background? What information does this earliest snapshot of the universe contain? We would start with a brief introduction to The Big Bang model and inflation and how inflation explains the isotropy in the universe, which is observable in its current state. Later we would indulge ourselves in understanding the first notes of music in the universe, called the baryon acoustic oscillations. Further getting into the details of the CMB, a particular plot of the cosmic microwave background called the Power Spectrum is obtained, revealing all the secrets of the CMB. This eventually leads us to the results that are widely seen today about the constituents of the universe as 70% Dark Energy, 25% Dark Matter, and 4% Matter that we normally interact with."
        },
        {
            "title": "Orbital Mechanics",
            "date": "April 23rd, 2020",
            "speaker": "Karan",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Things in orbit don't behave in the most intuitive manner. In this talk, we will go over the basics of the rocket equation and how to calculate delta-v budgets. We will intuitively see how rockets launch and manoeuvre in orbit. All this will be done using the legendary video game 'Kerbal Space Program'."
        },
        {
            "title": "The History of Measurement of the Speed of Light",
            "date": "February 15th, 2020",
            "speaker": "Abhipsa Mishra",
            "speaker_desc": "Int. M.Sc. B18 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "With the values of myriads of fundamental constants of the Universe at a click away we sometimes lose contact from Newton's wise words, \"We are standing on the shoulders of giants\". So, on February 15, 6:30 pm, 2020, we shall pause to look down at those strong shoulders and try understanding the roots and tips of the quest for measuring the speed of light, a param fundamental constant. We shall have our humble beginnings at the naïve insights of the olden days and carry on to notice how the progress of technology and polishing of the human mind has helped us chase the value of speed of light to what we believe to be it's truest value."
        },
        {
            "title": "Cosmological expansion and You ",
            "date": "February 1st, 2020",
            "speaker": "Akshay Priyadarshi and Karan",
            "speaker_desc": "Int. M.Sc. B16, B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Taking off from the topic of curvature, we delve into its implications in the real universe. Then, using a simple Newtonian approach, we derive the Friedmann equation, which relates the expansion to the energy and curvature of the universe. The equation is further used to model different versions of the universe, which gives us a perspective on the current observations. Finally, we introduce the mysterious Lambda to get an even more consistent model of the universe."
        },
        {
            "title": "Straight Paths in Curved Spaces.",
            "date": "January 15th, 2020",
            "speaker": "Pushpak Pandey and Renu Raman Sahu",
            "speaker_desc": "Int. M.Sc. B15 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "We know that light travels along a straight path, but is 'straight' what we know it to be? What does the space-time being flat or curved mean?  We shall explore these questions and discuss the notion of distance and curvature in a few simple geometries. We shall apply these ideas to find out the type of geometry we live in."
        },
        {
            "title": "Tic Tac Toe Cosmology",
            "date": "January 18th, 2020",
            "speaker": "Nisarg Vyas & Chandranathan",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Questions regarding our place in this vast object called universe are known to have invoked serious considerations about our understanding of it. We explore some of the school of thoughts in the talk. Translating the ideas of the talk in the language of mathematics flavoured with some infinities and observations, the talk, in itself, is complete! Borrowing rigour, contemplation and aesthetic from philosophy and science alike, we, sitting on the shoulders of giants, embark on a journey to the centre of the universe."
        },
        {
            "title": "The Story Behind the First Image of a Black Hole",
            "date": "January 11th, 2020",
            "speaker": "Dripto Biswas",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Last year, the scientific community was shown the first image of a black hole. In this talk, we will review the basic physics of a black hole, and why it is difficult to capture one using standard imaging techniques. We will also take a quick look at Very Long Baseline Interferometry (VLBI), which was the principle behind the Event Horizon Telescope. Finally, we will compare the image with the existing models of a black hole , and try to identify various components of the same."
        }
    ],
    "year19": [
        {
            "title": "Life on Mars",
            "date": "August 25th, 2019",
            "speaker": "Kanishk Kumar",
            "speaker_desc": "Int. M.Sc., SBS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Life on other planets has always been a fascinating endeavour for humans. But it doesn't necessarily mean extraterrestrial life or as we fondly call them, aliens. It also means exploring the possibility of settling human life on other planets. Our best possible candidate for this is Mars. This planet has been well explored, with respect to other planets and will be at the focus of several missions in the future as well. I will explain the current understanding of the situation of establishing life there, as well as future possibilities. Hopefully, it won't break marriages of the Indians who settle there ;-)."
        },
        {
            "title": "Climbing the ladder of cosmos",
            "date": "August 24th, 2019",
            "speaker": "Chandranathan and Nisarg Vyas",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "This elegant universe instils awe in all of us. Inquiring minds often ponder about their place in this big \"mess\". In this talk we will, step by step, climb the ladder of the cosmic distances. For a start, using only a ruler and a protractor we will see how far we can go. Then with the understanding of light, we will climb a step further and fathom the cosmic 'depths'."
        },
        {
            "title": "Virtual Astronomical Observatories",
            "date": "February 2nd, 2019",
            "speaker": "Satyam Chandra Mishra and Anshuman Padhi",
            "speaker_desc": "Int. M.Sc. B15 & B18 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "In an extension to the last week's NAC series talk, this time we will learn how to analyze the data collected from the telescopes. For this, we will use Virtual Educational Observatory (VIREO) which is a simulated observatory and can access a huge database of astronomical information, both through a set of dedicated catalogues and via online databases. It also simulates a very large and diverse sample of the observable astronomical sky, as seen with optical and radio telescopes, and thus can be used to carry out a wide variety of realistic observing projects. We will start by discussing Kepler's Laws and see how we can use them to predict the mass of the Jupiter, by observing its moons. I'll then present the basics of pulsar observation and explain the signal extraction technique from simulated noisy data."
        }
    ],
    "year18": [
        {
            "title": "The theory of Special Relativity",
            "date": "October 6th, 2018",
            "speaker": "Ashish Mishra and Debaiudh Das",
            "speaker_desc": "Int. M.Sc. B15 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": ""
        },
        {
            "title": "The Continuous Spectrum of Light",
            "date": "September 3rd, 2018",
            "speaker": "Dhanush S",
            "speaker_desc": "Int. M.Sc. B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": ""
        },
        {
            "title": "The Cosmic Distance Ladder",
            "date": "August 18th, 2018",
            "speaker": "Karan and Manabputra",
            "speaker_desc": "Int. M.Sc. B17 & B16 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": ""
        },
        {
            "title": "The Celestial Sphere",
            "date": "August 10th, 2018",
            "speaker": "Akshay Priyadarshi and Nisarg Vyas",
            "speaker_desc": "Int. M.Sc. B16 & B17 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": ""
        }
    ]
}
