{
    "upcoming": [
        {
            "title": "The Rise and Fall of Pluto!",
            "date": "January 13, 2024",
            "speaker": "Aniketh Nath",
            "speaker_desc": "Int. M.Sc. (B20), SPS, NISER",
            "poster": "13-01-24.png",
            "youtubeID": "",
            "abstract": "We all have heard that Pluto was considered the ninth planet of the solar system, but now it is no longer a planet. The story of Pluto from its discovery to its enlistment under the category of a dwarf planet is an interesting one. I shall try to cover some aspects of this story backed by the theoretical notions that were at play at different events of this story."
        }
    ],
    "year23": [
        {
            "title": "Shapes, Structures and Randomness",
            "date": "November 11, 2023",
            "speaker": "Dr. Pravabati Chingangbam",
            "speaker_desc": "Professor, Indian Institute of Astrophysics",
            "poster": "11-11-23.png",
            "youtubeID": "",
            "abstract": "The talk will introduce morphological descriptors known as scalar and tensorial Minkowski functionals, and Betti numbers. They are geometrical and topological quantities that quantify the morphological information of structures. We will connect these quantities to random fields and discuss how they reveal the statistical nature of the fields. Lastly, some physical  applications will be discussed."
        },
        {
            "title": "Introduction to Cosmology",
            "date": "October 20, 2023",
            "speaker": "Abhinav Roy",
            "speaker_desc": "Int. M.Sc. (B20), SPS, NISER",
            "poster": "",
            "youtubeID": "xHIQ9tcUKeY",
            "abstract": "Cosmology is the study of the physical universe and due to both theoretical and observational developments, it has made enormous strides in the past 100 years. Cosmology has answered age-old questions involving the universe's age, geometry, and composition. In this talk, we will see the journey of cosmology as a science, learn more about our universe, and discuss the efforts of a few to answer the questions of many."
        },
        {
            "title": "Orbital Dynamics near Lagrange Points",
            "date": "October 14, 2023",
            "speaker": "Sri Uma Maheshwari",
            "speaker_desc": "Int. M.Sc. (B22), SPS, NISER",
            "poster": "",
            "youtubeID": "Ck-VpP-x1FA",
            "abstract": "Many satellites, such as Aditya L1 and JWST, are seated at specific vantage points in space called Lagrange points. This talk will go step by step through the process of finding a numerical solution to an analytically unsolvable physical problem and also discuss the orbits of known astronomical objects around these points."
        },
        {
            "title": "Introductory Talk: An Introduction to Positional Astronomy",
            "date": "October 9, 2023",
            "speaker": "Gayatri P",
            "speaker_desc": "Int. M.Sc. (B22), SPS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc?start=2163",
            "abstract": "When you look at the night sky, you are greeted with the familiar sparkling points of light situated on the surface of a vast sphere of which you are at the centre. But to make any astronomical observation, you need to know precisely where to look, that is, the location of celestial objects in our night sky. Spherical or positional astronomy is a sub-field of astronomy that deals with the directions in which these celestial objects are viewed and predicts how they vary over space and time. One of the most ancient forms of science, here we learn how to locate objects on the celestial sphere — as seen at a particular date, time, and location on Earth — just as we measure positions on Earth's surface by Latitude and Longitude. Along the way, we also will encounter certain astronomical phenomena observed on Earth."
        },
        {
            "title": "Introductory Talk: An introduction to Astrophotography and the photo of the moon",
            "date": "October 9, 2023",
            "speaker": "Vishal Meena",
            "speaker_desc": "Int. M.Sc. (B22), SCS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc?start=1043",
            "abstract": "This talk will introduce the basics of astrophotography, with a focus on a photo of the moon that our club recently took. We will discuss the equipment and techniques that we used to capture the photo, as well as the challenges and rewards of astrophotography. The photo of the moon that we will be discussing is a high-resolution image that was taken using a telescope and a specialized sensor. The photo shows the moon in stunning detail, including its craters, mountains, and valleys. We will discuss how we captured the photo and how we processed the data to achieve such high quality."
        },
        {
            "title": "Introductory Talk: Search for water in the Universe",
            "date": "October 9, 2023",
            "speaker": "Asmi Nandy",
            "speaker_desc": "Int. M.Sc. (B22), SCS, NISER",
            "poster": "",
            "youtubeID": "xhRCo_LLqLc",
            "abstract": "For the longest time, we have been curious about the existence of life beyond Earth. Are we really alone in the Universe? This is a question we have been asking ourselves for quite some time. Water is supposed to be the a priori requirement that enabled life to evolve on our planet. It makes sense thus that we look for it elsewhere in the search for our brethren in space. How do we look for water, then? What are the processes used to detect its presence someplace millions of light years away from us? And how successful have we been in our search until now? Join us for the discussion session to find out!"
        },
        {
            "title": "Laboratory astrochemistry techniques for investigating kinetics of reactions in space",
            "date": "September 9, 2023",
            "speaker": "Aditi Pradhan",
            "speaker_desc": "Int. M.Sc. (Batch 19), SCS, NISER",
            "poster": "",
            "youtubeID": "ATTW-qrkLJ8",
            "abstract": "Over 200 species have been detected in the cold, neutral regions of the ISM over the past 80 years. The existence of such a rich and diverse range of chemistry even at very low temperatures and densities, raises several interesting questions about the origin of these species and how the energy barrier for reactions is surpassed at such low temperatures. The hunt for answers has led to the highly interdisciplinary field of Astrochemistry. Astrochemistry proceeds on 3 interlinked fronts, namely - observations, modelling and laboratory experiments. Laboratory astrochemistry is central to enhancing our understanding of the present composition of ISM, as well as the chemical origins of the universe. Laboratory spectroscopy aids observations in confirming the detection of new species in space. On the modelling front, parameters such as rate constants and branching ratios are required and can only be measured experimentally. The measurement of these parameters in a laboratory while mimicking the conditions in space, is a multi-fold challenge. This has led to the development of several novel experimental techniques, and innovative combinations of existing methods. The aim of this talk is therefore, to highlight the various experimental techniques involved in laboratory astrochemistry. More specifically, I will be discussing the novel CRESUCHIRP apparatus developed by Dr. Ian Sims and his group at the University of Rennes, where I worked over the summer."
        },
        {
            "title": "X-Ray Binaries and Use of MESA",
            "date": "September 2, 2023",
            "speaker": "Pulkit Ojha",
            "speaker_desc": "Research Assistant, IMSc, Chennai (B18 Alumni)",
            "poster": "",
            "youtubeID": "EUgdumX9SyQ",
            "abstract": "Binary stars, comprising more than 90% of the stars we see in our night sky, play a significant role in all kinds of astrophysical research. A peculiarly interesting category is x-ray binary, which happens to have compact stellar remnants, specifically a neutron star as one of their components. X-ray binaries act as space-based laboratories, allowing us to study the physics of accretion and the neutron star with good proximity observations. They also serve as progenitor systems to some exotic objects like millisecond pulsars and ultra-compact binaries releasing gravitational waves. For more than a year now, I've been working on modelling a class of such X-ray binaries using tools like MESA(Modules of Experiments in Stellar Astrophysics), the state-of-the-art Fortran-based 1D stellar simulation package. In the talk, I plan to start with a discussion about different classes of X-ray binaries and their wide applicability in astrophysics in the first part. Secondly, I’ll present a small overview of my thesis work and the significance of such theoretical studies. I’ll conclude the talk by talking about MESA, why it is important for anyone interested in working in astrophysics and how to use it as a beginner."
        },
        {
            "title": "Magnetic Field of Stars ",
            "date": "August 19, 2023",
            "speaker": "Monu Kumar Choubey",
            "speaker_desc": "Int. M.Sc. (Batch 20)",
            "poster": "",
            "youtubeID": "igfQQn2Zn-g",
            "abstract": "In this talk, I will introduce the study of magnetic field of stellar bodies, including their origin, modeling, observation and interpretation. There's a special focus on Sun and sun-like stars, extending to white dwarfs and other stellar bodies. Lastly, there's brief mention of exotic bodies like neutron stars and magnetars."
        },
        {
            "title": "The Ballet of the Medicean Stars",
            "date": "August 12, 2023",
            "speaker": "Shreya Jay  &  Samarth Mohan Nanjannavar",
            "speaker_desc": "Int. M.Sc. (B21), SPS, NISER",
            "poster": "",
            "youtubeID": "jJlra_udsA0",
            "abstract": "The main aim is to find out the time-period of 4 bright moons of  Jupiter (IO, Callisto, Ganymede, and Europa) on pure experimental background i.e., without using any theoretical knowledge. We present to you the first experiment that the NAC Experimental team undertook. This was first done by Galileo. The problems encountered during the data analysis were versatile. The logic and method of solving the problems encountered is especially emphasised upon. Further we also used the data to find the mass of Jupiter using some basic literature on the topic."
        },
        {
            "title": "Hunting low-frequency gravitational waves through Pulsar Timing Arrays: The role of Indian Pulsar Timing Array",
            "date": "July 29, 2023",
            "speaker": "Dr. Manjari Bagchi",
            "speaker_desc": "Astrophysicist, IMSc, Chennai",
            "poster": "29-07-23.png",
            "youtubeID": "",
            "abstract": "We know that gravity is just the curvature of the spacetime. A mass curves the spacetime around it, and both massive and massless particles follow the curvature of the spacetime. Motion (translational, rotational or vibrational) of massive particles generate ripples in the spacetime or gravitational waves. Like electromagnetic waves, gravitational waves also have a wide range of frequencies. Gravitational waves of different frequencies are created by different sources āand we need different types of detectors to detect them. There is an innovative āmethod to detect low-frequency gravitational waves by using a number of undead stars as the detectors. These low-frequency gravitational waves are caused by mergers of supermassive black holes, and not only one mergers, many mergers resulting a summed-up background wave. As pulsars are the special type of undead star used for this purpose, we call such experiments as Pulsar Timing Array experiments. Presently, there are multiple Pulsar Timing Array experiments ongoing in various continents. These groups recently declared their results revealing a hint of the low-frequency gravitational waves. Indian Pulsar Timing Array (InPTA) is an Indo-Japanese collaboration performing PTA experiment using Indian telescope, the upgraded Giant Metrewave Radio Telescope. In the present talk, I will briefly discuss low-frequency gravitational waves, the basics of a PTA experiment, and the contribution of InPTA in this field."
        },
        {
            "title": "A Misty Mystery: Unraveling Cloud Formation in Alien Skies",
            "date": "April 22, 2023",
            "speaker": "Rahul Arora",
            "speaker_desc": "Int. MSc. (Batch 18), SEPS, NISER",
            "poster": "",
            "youtubeID": "0ZD5jV02bo8",
            "abstract": "Cloud formation plays a key role in the atmospheric dynamics of exoplanets, which can significantly impact their overall climate and habitability. This makes understanding of cloud formation and evolution in exoplanetary atmospheres very critical for interpreting observational data and characterizing these faraway worlds. In this talk, we will explore the various physical and chemical processes that contribute to cloud formation on exoplanets, such as condensation, nucleation, and growth. We will also discuss how cloud properties such as composition, size, and distribution can vary depending on the specific environmental conditions of the exoplanetary atmosphere, such as temperature, pressure, and atmospheric composition. In the end, we will review the current theoretical approaches for studying cloud formation in exoplanets and their impacts on observational interpretation and highlight some of the key challenges and open questions in this rapidly-evolving field of research."
        },
        {
            "title": "Thinking Prebiotically: The study of Chemical Origin of Life and its Astronomical Implications",
            "date": "March 25, 2023",
            "speaker": "Adesh Natthuji Thawale",
            "speaker_desc": "Int. MSc. (Batch 18), SCS, NISER",
            "poster": "",
            "youtubeID": "cJRskYH3efk",
            "abstract": "One of the leading theories for the origin of life is the Chemical Origin of Life, which involves mixing and matching simple molecules to form complex ones. Think of it like a giant chemistry experiment, but instead of baking a cake, we are trying to create life. But if you're feeling adventurous and want to explore more before the talk, we've got some papers at the end that will give you a deeper dive into the topic. Who knows, you might even find your calling in life (pun intended) and become a Chemical Origin of Life researcher. So, join us for a discussion that will be equal parts informative and entertaining. Let's get to the bottom of how life began!"
        },
        {
            "title": "Keep Calm and Let The Planets Form",
            "date": "January 28, 2023",
            "speaker": "Baibhav Srivastava",
            "speaker_desc": "IISER Berhampur, Batch 18",
            "poster": "28-01-23.jpg",
            "youtubeID": "",
            "abstract": "By now you all surely know that planets form in disk-like structures, called protoplanetary disks, around young stars. But how exactly?"
        },
        {
            "title": "How did our Earth and Solar system form?",
            "date": "January 21, 2023",
            "speaker": "Prathap Rayalacheruvu",
            "speaker_desc": "PhD Scholar (SEPS), NISER",
            "poster": "21-01-23.jpg",
            "youtubeID": "",
            "abstract": "Our Solar System is believed to have been formed about 4.6 billion years ago in a cold molecular cloud. Its origin and evolution are still a mystery. The present state of planetary bodies, including our own Earth and the life on it are the direct result of various evolutionary processes that these planetary objects have gone through during these many years. Now the question is “Can we trace down the evolutionary processes of the planetary bodies and understand how life came about on planets like our Earth?” In this talk I will introduce you to some astrochemical tools which go a long way in addressing the above question."
        },
        {
            "title": "Alien worlds in the JWST era: No more a Science fiction",
            "date": "January 14, 2023",
            "speaker": "Priyankush Ghosh",
            "speaker_desc": "PhD Scholar (SEPS), NISER",
            "poster": "14-01-23.jpg",
            "youtubeID": "",
            "abstract": "Ever since humanity has existed, it has looked into the night sky and wondered “Is there life elsewhere in the universe?” and “How did our Earth and other planets form and evolve?” Exoplanetary science, a new interdisciplinary field that emerged 25 years ago has the capability to answer just that. This talk involves basic introduction to the far away alien worlds, why are they so interesting, how to find them, what are the current research works going on in the field and what future beholds. I will also discuss how to decode an exoplanet spectrum to search for signs of alien life and its implication with respect to current research."
        }
    ],
    "year22": [
        {
            "title": "Surfing through Exoplanets",
            "date": "November 12th, 2022",
            "speaker": "Chandan Kumar Sahu",
            "speaker_desc": "Int. M.sc. B19 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "In this vast universe, it is inappropriate to think that Earth is the only planet sustaining life. So, are there really planets outside our solar system that can host life? Billions are spent every year on detection and study of planets which can possibly host life. This talk will be an introduction to the basic methods that are used in the modern era for detection of exoplanets and studying them. I will also hover over the different types of exoplanets and some of their properties. At the end, I will briefly mention current research in the field of exoplanetary systems."
        },
        {
            "title": "Determination of Solar offset using Cepheids",
            "date": "November 5th, 2022",
            "speaker": "Swaroop R Averesekar",
            "speaker_desc": "Int. M.sc. B19 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "The sun's galactocentric radius (RGC) is previously calculated and known. It has also been established that our sun is not located precisely on the galactic plane but is slightly displaced. Previous estimates have calculated this solar offset (z) using sources such as OB stars, young open clusters (YOCs), pulsars, Etc. The right ascension and declination of Cepheids, obtained from The Optical Gravitational Lensing Experiment (OGLE) catalog cross-matched with the GAIA mission's - DR3, provides a way to calculate the z. This talk will give a quick tour into Cepheids, the data, and visualize the sun's coordinates in the milky way galaxy."
        },
        {
            "title": "Introduction to Cosmology: A chronology of the Universe",
            "date": "October 15th, 2022",
            "speaker": "Soham Bannerjee",
            "speaker_desc": "PhD, SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Observational Cosmology has come a long way. The Cosmological Principle states that the Universe is spatially homogeneous and isotropic on the largest scales. Hubble's data indirectly proved this principle when he found the relation between the speed and distance of galaxies. The Big Bang model has been widely accepted, which claims that the Universe evolved from a fireball that eventually cools to the structures we see today. Peebles suggested radiation from the early Universe, which was discovered by Penzias and Wilson, as the cosmic microwave background, which gives a compelling foundation for this model. In this talk, the speaker gave an overview of the formation of light nuclei(big bang nucleo-synthesis), recombination(formation of first atoms), the radiation from the early Universe(CMB), and large-scale structure formation."
        },
        {
            "title": "Introduction to Cosmology: Why is the night sky dark?",
            "date": "September 4th, 2022",
            "speaker": "Abha Vishwakarma",
            "speaker_desc": "Int. M.sc., B19 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "The night sky appears very different from the earth or the solar system. At a very large scale, large enough to contain many, many galaxy clusters, our universe looks and behaves very differently compared to solar systems, individual galaxies or even clusters of galaxies. Gravity doesn't seem to work according to Newtonian principles. A new theory of gravity, the General Theory of Relativity, formulated by Albert Einstein, sheds light on our understanding of the large-scale universe. In this talk, I will take you through the history that led to the birth of Cosmology, the study of the nature of our universe. I will then develop the notion of 'curvature of the universe', discuss how it can be measured and discuss its implications on the notion of distance between any two points in the universe. This talk covers the prerequisites required to understand the Friedmann equations and the governing equations of the universe's evolution, which will be covered in the next talk. The goal at the end will be to have an interactive talk, where I will simulate universes with different densities of matter, radiation etc. using python and see how it evolves with time."
        },
        {
            "title": "Stellar Astrophysics II: Classification and Evolution of stars",
            "date": "August 27th, 2022",
            "speaker": "Vasanth Kashyap, Pulkit Ojha",
            "speaker_desc": "Int. M.sc. B19, SPS, NISER, Int. M.sc., B18 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "In the last talk on stellar astrophysics, the basics of stellar structure and the origin of stars was covered by Vasanth. In the upcoming talk, the classification of stars based upon their spectral luminosity will be discussed and if time permits, we'll also try to present a basic overview of stellar evolution. This talk may be followed by a demonstration of stellar evolution using MESA."
        },
        {
            "title": "Stellar Astrophysics: Origin, Structure and Classification",
            "date": "August 20th, 2022",
            "speaker": "Vasanth Kashyap",
            "speaker_desc": "Int. M.sc., B19 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "This is the second talk in the 'Stellar Physics Triad'. In this talk I hope to glance over the fundamentals of stellar astrophysics. Topics of star formation, stellar structure and spectral classification shall be discussed along with their underlying principles with sufficient mathematical detail. It will be followed by brief discussions on Hertzsprung Diagram and Morgan Keenan Luminosity Classes."
        },
        {
            "title": "The Solar Cycle, Magnets, and More",
            "date": "August 13th, 2022",
            "speaker": "Ratul Das",
            "speaker_desc": "Int. M.sc., B20 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "The Babcock-Leighton model of the solar dynamo is often noted as the most accurate qualitative mechanism for explaining the Solar cycle, despite being initially formulated about 70 years ago, when only terrestrial data from the Sun was available. It successfully explained how and why sunspots form, along with the relation between the oscillatory 22-year Solar cycle and the evolution of the magnetic field (basically, a whole backflip) of the Sun."
        },
        {
            "title": "Birth of Cosmology",
            "date": "April 23rd, 2022",
            "speaker": "Abhinav Roy",
            "speaker_desc": "Int. M.sc. B20 SPS, NISER",
            "poster": "",
            "link": "",
            "abstract": "Cosmology is the study of the physical universe and due to both theoretical and observational developments, it has made enormous strides in the past 100 years. Cosmology has answered age-old questions involving the universe's age, geometry, and composition. In this talk, we will see the journey of cosmology as a science and the efforts of a few to answer the questions of many."
        }
    ]
}